# Пример 1-го цикл через операторы and и or

print('Козацького здоровья! Ну що, почнемо?')   # Старотовая фраза бота
first_question = input('\n >')  # Переменная для первого вопроса
while first_question.lower() != 'привіт' and first_question.lower() != 'хай' and \
        first_question.lower() != 'доброго дня':    # Условие цикла с переводом в нижний регистр
    print('Дуже цікаво, але, нажаль, нічого не зрозуміло :(')   # Вывод результата
    first_question = input('>')     # Повторный ввод пользователя
if first_question.lower() == 'привіт' or first_question.lower() != 'хай' or\
        first_question.lower() != 'доброго дня':    # Условие если цикл False
    print('Доброго вечора, я бот з України!')   # Вывод результата


# Пример 2-го цикла через операторы not in в строке

second_question = input('>')    # Ввод пользователя
second_question_frases = 'як справи? / що робиш? / чим займаєшся?'  # Строка ключевых слов
while second_question.lower() not in second_question_frases:    # Условие цикла с переводом в нижний регистр
    print('Дуже цікаво, але, нажаль, нічого не зрозуміло :(')   # Вывод результата
    second_question = input('>')    # Повторній ввод пользователя
if second_question.lower() in second_question_frases:   # Условие если цикл False
    print('Вчусь програмувати на Python!')  # Вывод результата


# Пример 3-го цикла через not in в списке

third_question_frases = ['фільм', 'кінотеатр', 'серіал']    # Список ключевых слов
third_question = input('>') # Повторный ввод пользователя
while third_question.lower() not in third_question_frases:  # Условие цикла с переводом в нижний регистр
    print('Дуже цікаво, але, нажаль, нічого не зрозуміло :(')   # Вывод результата
    third_question = input('>')     # Повторный ввод пользователя
if third_question.lower() == 'фільм':   # Условие если ключевое слово "фильм"
    print('Рекомендую подивитися "Веном" виключно українською мовою, дуже файний переклад!=)')  # Вывод результата для фильма
if third_question.lower() == 'кінотеатр':   # Условие если ключевое слово "Кинотеатр"
    print('Зараз не найкращий час для відвідування кінотеатрів, краще йди провітри свій мозок на свіжому повітрі, '
          'воно доречі, поки що БЕЗКОШТОВНЕ!=)')   # Вывод результата для кинотеатра
if third_question.lower() == 'серіал':  # Условие если ключевое слово "сериал"
    print('Ну тут все просто, подивісь "Король Талси" зі Сільвестром Сталоне у головній ролі, старикашка не '
          'погано так віконує роль рішали=)')   # Вывод результата для сериала


# Четвертый цикл ( получается самый компактный, исключающий ввода предложениями со словами из списка для продолжения
# работы цикла.

four_question_frases = ['бувай', 'надобраніч', 'гудбай', 'до зустрічі']  # Список ключевых слов
four_question = input('>')  # Повторный ввод пользователя
while four_question.lower() not in four_question_frases:    # Условие цикла с переводом в нижний регистр
    print('Дуже цікаво, але, нажаль, нічого не зрозуміло :(')   # Вывод результата если условие True
    four_question = input('>')  # Повторный ввод пользователя
if four_question.lower() in four_question_frases:   # Условие если цикл False
    print("Побачимось у мережі, I'll be back")  # Вывод результата

    # постарался написать разными способами не забегая вперед по материалу.
