input_str = input('1. Привіт, напиши що завгодно для перевірки, не соромся своїх фантазій;) : ')  # Входящая строка
# от пользователя
input_str_low = input_str.lower()  # Новая переменная в которой записано изменение регистра введенной строки
print('2. Програма переводить строку в нижній регістр: ', input_str_low)  # Вывод результата с измененным регистром
char_to_remove = [',', '!', '.', ':', ';', '?', '-', ')']  # Список символов для удаления из строки
for i in char_to_remove:  # Цикл для перебора символов и удаление через replace
    input_str_low = input_str_low.replace(i, '')
print('3. Програма видаляє зі строки такі символи пунктуації(.,-:;?!)  :', input_str_low)  # Вывод строки без символов
# пунктуации
input_str_low = input_str_low.rstrip()  # Удаление пробела и табуляции с правого края строки
print('4. Програма видаляє зайві пробіли\\табуляції з правого кінця строки: ', input_str_low)  # Вывод результата
# удаления символов пунктуации
change_str = input('5. А зараз давай змінемо щось у твоїй бурній фантазії, яке саме слово\\словосполучення ти хотів '
                   'би ''замінити? : ')  # Новая переменная для словочетания которое хочет изменить пользватель
change_str = change_str.lower()  # Перевод в нижний регистр, для исключения чувствительности к регистру
print('6. Фааайно, можешь, коли бажаєшь! Воно присутнє на індексі:', input_str_low.index(change_str))  # Вывод
# индекса выбраного словосочетания
new_change_str = input('7. На яке саме слово\\словосполучення змінимо?: ')  # Новая переменная для нового слова
# которое хочет заменить пользователь
input_str_low = input_str_low.replace(change_str, new_change_str)  # Замена старого слова на новое
print(input_str_low)  # Вывод на экран конечного результата
