notes_list = ['this is note', 'this is notissimo', 'note', 'this is a huge long, insanely long note',
              'well, anyways']
command_notations = {
    'add': '- додати нотатку.',
    'earliest': '- виводить збережені нотатки у хронологічному порядку - від найранішої до '
                'найпізнішої',
    'latest': ' - виводить збережені нотатки у хронологічному порядку - від найпізнішої до найранішої',
    'longest': ' - виводить збережені нотатки у порядку їх довжини - від найдовшої до найкоротшої',
    'shortest': ' - виводить збережені нотатки у порядку їх довжини - від найкоротшоїдо найдовшої'}
